In [1]:
import pandas as pd
import numpy as np

Create Data using numpy

In [2]:
data=np.arange(0,20)
#reshape this rray into a matrix
data=data.reshape(5,4) #5 rows and 4 columns

Creating DataFrame

In [3]:
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4","Row5"],columns=["Col1","Col2","Col3","Col4"])
print(df)

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

Check for the First 5 Rows and first 5 columns

In [4]:
df.head()   #display first 5 rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [5]:
df.tail() #display lst five rows of dataFrame

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [6]:
#can be customized to display any number of rows
df.head(2) #dispay first 2 rows

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

In [7]:
df.tail(2) #last 2 rows

      Col1  Col2  Col3  Col4
Row4    12    13    14    15
Row5    16    17    18    19

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    5 non-null      int32
 1   Col2    5 non-null      int32
 2   Col3    5 non-null      int32
 3   Col4    5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [10]:
df.describe()

            Col1       Col2       Col3       Col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

Indexing using Column Names

In [11]:
#use single brackets when acess only one column
df["Col1"]

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: Col1, dtype: int32

In [12]:
#we use nested brackets when we have to access more than 1 column
df[["Col1","Col2"]]

      Col1  Col2
Row1     0     1
Row2     4     5
Row3     8     9
Row4    12    13
Row5    16    17

Indexing using Row Names (loc)

In [13]:
df.loc["Row1"] #single row

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [14]:
df.loc[["Row1","Row2"]] #multiple row

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7

Accessing by proper index number

In [15]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [16]:
df.iloc[2:4,0:2] #element from 2nd row to 3rd and oth olumn to 1st

      Col1  Col2
Row3     8     9
Row4    12    13

In [17]:
df.iloc[2:,1:]

      Col2  Col3  Col4
Row3     9    10    11
Row4    13    14    15
Row5    17    18    19

In [18]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [19]:
df.iloc[0:,3:]

      Col4
Row1     3
Row2     7
Row3    11
Row4    15
Row5    19

In [20]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

#Convert dataframe into array

In [21]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

Basic Operations

In [22]:
#check if there is null values in df
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [23]:
df1 = pd.DataFrame(
    data=[[1, np.nan, 2], [4, 5, 6]],
    index=["Row1", "Row2"],
    columns=["col1", "col2", "col3"]
)
df1

      col1  col2  col3
Row1     1   NaN     2
Row2     4   5.0     6

In [24]:
df1.isnull().sum()

col1    0
col2    1
col3    0
dtype: int64

In [25]:
df1.isnull()

       col1   col2   col3
Row1  False   True  False
Row2  False  False  False

In [26]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [27]:
df["Col3"].value_counts() #ount for particular values occured in a column

Col3
2     1
6     1
10    1
14    1
18    1
Name: count, dtype: int64

# Working with industry.csv file using pandas

In [28]:
data=pd.read_csv("C:\PYTHON- Tutorial\PYTHON-Libraries\industry.csv")

In [29]:
data.head()

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing
4                     Automotive

In [30]:
data.tail()

                    Industry
38             Skilled Labor
39                Technology
40        Telecommunications
41  Transportation/Logistics
42                     Other

In [31]:
col=pd.read_csv("industry.csv",usecols=["Industry"])
col.head()

                        Industry
0             Accounting/Finance
1   Advertising/Public Relations
2             Aerospace/Aviation
3  Arts/Entertainment/Publishing
4                     Automotive

In [32]:
col.to_csv("test.csv")

In [33]:
data=('a,b,c,d\n'
      '1,2,3,4\n'
      '5,6,7,8\n'
      'e,f,g')

data

'a,b,c,d\n1,2,3,4\n5,6,7,8\ne,f,g'

In [34]:
from io import StringIO

df1=pd.read_csv(StringIO(data))

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      float64
dtypes: float64(1), object(3)
memory usage: 228.0+ bytes

In [36]:
df1=pd.read_csv(StringIO(data),dtype=object)

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      object
 1   b       3 non-null      object
 2   c       3 non-null      object
 3   d       2 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [38]:
df1

   a  b  c    d
0  1  2  3    4
1  5  6  7    8
2  e  f  g  NaN

In [39]:
df1.isnull().sum()

a    0
b    0
c    0
d    1
dtype: int64

In [40]:
df1.dtypes

a    object
b    object
c    object
d    object
dtype: object

## Pandas Working with JSON

In [41]:
data='{"name": "sejal","age":20,"email":"sejal@gmail.com","job-profile":[{"role1": "Data scientist","role2": "Data analysts"}]}'

In [42]:
type(data)

str

In [43]:
Sdata=pd.read_json(str(data))

C:\Users\Dell\AppData\Local\Temp\ipykernel_12044\210628911.py:1: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  Sdata=pd.read_json(str(data))

In [44]:
#giving indx as orient make key as index
pd.read_json(str(data),orient='index')

C:\Users\Dell\AppData\Local\Temp\ipykernel_12044\472062736.py:2: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(str(data),orient='index')

                                                             0
name                                                     sejal
age                                                         20
email                                          sejal@gmail.com
job-profile  [{'role1': 'Data scientist', 'role2': 'Data an...

In [45]:
df=pd.DataFrame([['a','b'],['c','d']],
                index=['row1','row2'],
                columns=['col1','col2'])

In [46]:
df

     col1 col2
row1    a    b
row2    c    d

### Convert dataframe to json format

In [47]:
df.to_json()

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [48]:
df.to_json(orient='index')

'{"row1":{"col1":"a","col2":"b"},"row2":{"col1":"c","col2":"d"}}'

In [49]:
df.to_json(orient='columns')

'{"col1":{"row1":"a","row2":"c"},"col2":{"row1":"b","row2":"d"}}'

In [50]:
df.to_json(orient='records')

'[{"col1":"a","col2":"b"},{"col1":"c","col2":"d"}]'

In [51]:
df.to_json(orient='table')

'{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}'

In [52]:
schema={"schema":{"fields":[{"name":"index","type":"string"},{"name":"col1","type":"string"},{"name":"col2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row1","col1":"a","col2":"b"},{"index":"row2","col1":"c","col2":"d"}]}

# Pandas Working with HTML

In [53]:
pip install html5lib

Requirement already satisfied: html5lib in c:\users\dell\anaconda3\lib\site-packages (1.1)
Requirement already satisfied: six>=1.9 in c:\users\dell\appdata\roaming\python\python311\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\dell\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [54]:
html_data=pd.read_html("https://en.wikipedia.org/wiki/Mobile_country_code")

In [55]:
html_data

[   MCC  MNC Brand      Operator       Status Bands (MHz)  \
 0    1    1  TEST  Test network  Operational         any
 1    1    1  TEST  Test network  Operational         any
 2  999   99   NaN  Internal use  Operational         any
 3  999  999   NaN  Internal use  Operational         any

                               References and notes
 0                                              NaN
 1                                              NaN
 2  Internal use in private networks, no roaming[6]
 3  Internal use in private networks, no roaming[6]  ,
      Mobile country code                                    Country ISO 3166  \
 0                    289                                 A Abkhazia    GE-AB
 1                    412                                Afghanistan       AF
 2                    276                                    Albania       AL
 3                    603                                    Algeria       DZ
 4                    544  American Samoa (United States of America)       AS
 ..                   ...                                        ...      ...
 247                  452                                    Vietnam       VN
 248                  543                        W Wallis and Futuna       WF
 249                  421                                    Y Yemen       YE
 250                  645                                   Z Zambia       ZM
 251                  648                                   Zimbabwe       ZW

                                   Mobile network codes National MNC authority  \
 0             List of mobile network codes in Abkhazia                    NaN
 1          List of mobile network codes in Afghanistan                    NaN
 2              List of mobile network codes in Albania                    NaN
 3              List of mobile network codes in Algeria                    NaN
 4       List of mobile network codes in American Samoa                    NaN
 ..                                                 ...                    ...
 247        List of mobile network codes in the Vietnam                    NaN
 248  List of mobile network codes in Wallis and Futuna                    NaN
 249          List of mobile network codes in the Yemen                    NaN
 250             List of mobile network codes in Zambia                    NaN
 251           List of mobile network codes in Zimbabwe                    NaN

                       Remarks
 0    MCC is not listed by ITU
 1                         NaN
 2                         NaN
 3                         NaN
 4                         NaN
 ..                        ...
 247                       NaN
 248                       NaN
 249                       NaN
 250                       NaN
 251                       NaN

 [252 rows x 6 columns],
      MCC  MNC     Brand                  Operator           Status  \
 0    901    1       NaN                   Webbing          Unknown
 1    901    2       NaN            GlobalmatiX AG          Unknown
 2    901    3   Iridium                       NaN      Operational
 3    901    4       NaN  BBIX Singapore Pte. Ltd.          Unknown
 4    901    5       NaN      Thuraya RMSS Network      Operational
 ..   ...  ...       ...                       ...              ...
 99   902    1       NaN        MulteFire Alliance      Operational
 100  991    1       NaN    World's Global Telecom  Not operational
 101  991    2  5G Croco               Orange S.A.  Not operational
 102  991    3       NaN                 Halys SAS  Not operational
 103  991    4       NaN              E-Space Inc.          Unknown

     Bands (MHz)                               References and notes
 0          MVNO            Former ICO Satellite Management[51][52]
 1       Unknown  Former Sense Communications International; veh...
 2     Satellite                                                NaN
 3       Unknown                              Former Globalstar[54]
 4     Satellite                                                NaN
 ..          ...                                                ...
 99          LTE                                           [6][126]
 100     Unknown  temporarily assigned until 15 January 2021[104...
 101          5G  temporarily assigned until 6 August 2022[128][...
 102     Unknown  temporary assignment for trial until 5 April 2...
 103   Satellite  temporary assignment for trial until 17 Oct 20...

 [104 rows x 7 columns],
    MCC  MNC     Brand                 Operator       Status Bands (MHz)  \
 0  995    1  FonePlus  Sure (Diego Garcia) Ltd  Operational     GSM 900

                                 References and notes
 0  There appears to be no officially assigned MCC...  ,
                                vteTelecommunications  \
 0                                            History
 1                                           Pioneers
 2                                 Transmission media
 3                     Network topology and switching
 4                                       Multiplexing
 5                                           Concepts
 6                                   Types of network
 7                                   Notable networks
 8                                          Locations
 9  Telecommunication portal  Category  Outline  C...

                              vteTelecommunications.1
 0  Beacon Broadcasting Cable protection system Ca...
 1  Nasir Ahmed Edwin Howard Armstrong Mohamed M. ...
 2  Coaxial cable Fiber-optic communication optica...
 3  Bandwidth Links Network switching circuit pack...
 4  Space-division Frequency-division Time-divisio...
 5  Communication protocol Computer network Data t...
 6  Cellular network Ethernet ISDN LAN Mobile NGN ...
 7  ARPANET BITNET CYCLADES FidoNet Internet Inter...
 8  Africa Americas North South Antarctica Asia Eu...
 9  Telecommunication portal  Category  Outline  C...  ]

In [56]:
type(html_data)

list

In [57]:
html_data[0]

,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
0,1,1,TEST,Test network,Operational,any,NaN
1,1,1,TEST,Test network,Operational,any,NaN
2,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"
3,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"

In [58]:
html_data[1]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [59]:
html_data[0].to_html('demo.html')

#  Pandas working with XML

In [60]:
pd.read_xml('test.xml')

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
2   3  Charlie     78
3   4    David     92

In [61]:
xml='''<?xml version="1.0" encoding="UTF-8"?>
<table>
    <row>
        <ID>1</ID>
        <Name>Alice</Name>
        <Score>85</Score>
    </row>
    <row>
        <ID>2</ID>
        <Name>Bob</Name>
        <Score>90</Score>
    </row>
    <row>
        <ID>3</ID>
        <Name>Charlie</Name>
        <Score>78</Score>
    </row>
    <row>
        <ID>4</ID>
        <Name>David</Name>
        <Score>92</Score>
    </row>
</table>
'''

In [62]:
pd.read_xml(xml)

C:\Users\Dell\AppData\Local\Temp\ipykernel_12044\2704978085.py:1: FutureWarning: Passing literal xml to 'read_xml' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_xml(xml)

   ID     Name  Score
0   1    Alice     85
1   2      Bob     90
2   3  Charlie     78
3   4    David     92

# Python Pickling and Unpickling Data

In [65]:
import seaborn as sns
data=sns.load_dataset('tips')
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [66]:
import pickle

In [68]:
filename='file.pkl'

## Serialize process
pickle.dump(data,open(filename,'wb'))

In [69]:
## Deserialize  process
pickle.load(open(filename,'rb'))

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]